#include <iostream>


// Преимущества:
// 1. Не требуется непрерывной области памяти
// 2. Простая вставка
// 3. Простое удаление

// Недостаки
// 1. Суммарный объём памяти больше, чем в аналогичном массиве
// 2. Сложность поиска O(n)

// ------------------------------------------

// Динамическиее структуры
// 0. Массивы
// 1. Односвязный список
// 2. Двусвязный список
// 3. Дерево (бинарное дерево поиска)
// 4. --доп--  Хэш-таблицы


// Правила доступа / управления данными
// 1. Стэк
// 2. Очередь (обычная, кольцевая, с приоритетным включеним, с приоритетным исключением...)
//              можно построить:
//                  + массив
//                  + односвязный список
//                  + двусвязный список




int main()
{
    std::cout << "Hello World!\n";
}


